app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-07-02 13:42:23.535563"], ["updated_at", "2019-07-02 13:42:23.535563"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-07-02 13:42:23.550421"], ["updated_at", "2019-07-02 13:42:23.550421"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]
UPDATE "songs" SET "updated_at" = ?, "artist_id" = ? WHERE "songs"."id" = ?  [["updated_at", "2019-07-02 13:42:23.579344"], ["artist_id", 2], ["id", 2]]
---
  def upload
    CSV.foreach(params[:file].path,headers: true) do |f|
      song = Song.create(title: f[0])
      artist = Artist.find_or_create_by(name: f[1])
      song.artist = artist
      song.save